In [1]:
import pandas as pd
df = pd.DataFrame({"A":[5,3,None,4], 
                 "B":[None,2,4,3], 
                 "C":[4,3,8,5], 
                 "D":[5,4,2,None]})

In [2]:
df[['A','C']]

     A  C
0  5.0  4
1  3.0  3
2  NaN  8
3  4.0  5

In [3]:
df

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

In [7]:
df[0:2]

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0

In [11]:
df.iloc[:2,:3]

     A    B  C
0  5.0  NaN  4
1  3.0  2.0  3

In [12]:
df[:2]

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0

In [13]:
df.loc[:2]

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0

In [14]:
df.iloc[:2,:]

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0

In [16]:
df[(df['A']<5)&(df['C']<4)]

     A    B  C    D
1  3.0  2.0  3  4.0

In [17]:
df['C'].replace(4,40)

0    40
1     3
2     8
3     5
Name: C, dtype: int64

In [18]:
df

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

In [19]:
df['D'].replace(2,499)

0      5.0
1      4.0
2    499.0
3      NaN
Name: D, dtype: float64

In [20]:
df.sort_values(by=['A'],ascending=False)

     A    B  C    D
0  5.0  NaN  4  5.0
3  4.0  3.0  5  NaN
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0

In [21]:
df.sort_values(by=['B'],ascending=False)

     A    B  C    D
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN
1  3.0  2.0  3  4.0
0  5.0  NaN  4  5.0

In [22]:
df.sort_values(by=['A','C'],ascending=[False,True])

     A    B  C    D
0  5.0  NaN  4  5.0
3  4.0  3.0  5  NaN
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0

In [23]:
df

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

In [24]:
df.drop('A',axis=1)

     B  C    D
0  NaN  4  5.0
1  2.0  3  4.0
2  4.0  8  2.0
3  3.0  5  NaN

In [25]:
df.drop(3,axis=0)

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0

In [26]:
df.T

     0    1    2    3
A  5.0  3.0  NaN  4.0
B  NaN  2.0  4.0  3.0
C  4.0  3.0  8.0  5.0
D  5.0  4.0  2.0  NaN

In [27]:
df.T.T

     A    B    C    D
0  5.0  NaN  4.0  5.0
1  3.0  2.0  3.0  4.0
2  NaN  4.0  8.0  2.0
3  4.0  3.0  5.0  NaN

In [28]:
df4 = pd.DataFrame([
                     ['a', 'b', 'c'], 
                     ['d', 'e', 'f']
                    ],
                    columns= ['one', 'two', 'three'],
                    index = ['first', 'second'])

In [29]:
df4

       one two three
first    a   b     c
second   d   e     f

In [30]:
df4.stack()

first   one      a
        two      b
        three    c
second  one      d
        two      e
        three    f
dtype: object

In [31]:
df4.unstack()

one    first     a
       second    d
two    first     b
       second    e
three  first     c
       second    f
dtype: object